
package ir.pooyamoradi.isfahan_ziba;

import android.app.Activity;
import android.content.Intent;
import android.graphics.BitmapFactory;
import android.graphics.Typeface;
import android.support.v7.app.AppCompatActivity;
import android.os.Bundle;
import android.view.Display;
import android.view.Menu;
import android.view.MenuItem;
import android.view.View;
import android.webkit.WebView;
import android.widget.AdapterView;
import android.widget.ArrayAdapter;
import android.widget.Button;
import android.widget.CheckBox;
import android.widget.CompoundButton;
import android.widget.EditText;
import android.widget.ImageButton;
import android.widget.ImageSwitcher;
import android.widget.ImageView;
import android.widget.LinearLayout;
import android.widget.ListView;
import android.widget.TextView;
import android.widget.Toast;

import java.util.ArrayList;
import java.util.List;

public class MainActivity extends AppCompatActivity {
    List<String> items;
    ListView listView;
    ArrayAdapter<String> adapter;
    ImageButton btnBack;
    TextView Matn;
    TextView Title;
    ImageView Image;
    ImageView ImageEnd;
    WebView webView;

    /////////////////////////////////////


    /////////////////////////////////////
    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_main_page);
        ListData();
        listView = findViewById(R.id.contentList);

        OpenActivityForShow();
        DisplayList();

    }


    private void OpenActivityForShow() {

        listView.setOnItemClickListener(new AdapterView.OnItemClickListener() {
            @Override
            public void onItemClick(AdapterView<?> parent, View view, int position, long id) {


                if (items.get(position) == "سی و سه پل") {

                    setContentView(R.layout.activity_si_o_se_pol);
                    Title = findViewById(R.id.txtTitle);
                    SetTitleFont();
                    Title.setText("سی و سه پل");
                    MatnSiOSePol();
                    btnBack = findViewById(R.id.btnBack);
                    btnBack.setOnClickListener(new View.OnClickListener() {
                        @Override
                        public void onClick(View v) {
                            Image = findViewById(R.id.imageViewMain);
                            ImageEnd = findViewById(R.id.imageEnd);
                            Image.setImageResource(R.drawable.siosepol);
                            ImageEnd.setImageResource(R.drawable.siosepolend);

                            setContentView(R.layout.activity_main_page);
                            ListData();
                            listView = findViewById(R.id.contentList);
                            DisplayList();

                            OpenActivityForShow();

                        }
                    });
                } else if (items.get(position) == "پل خواجو") {

                    setContentView(R.layout.activity_si_o_se_pol);
                    Image = findViewById(R.id.imageViewMain);

                    Image.setImageResource(R.drawable.khajoo);

                    ImageEnd = findViewById(R.id.imageEnd);
                    ImageEnd.setImageResource(R.drawable.aalighapooend);
                    Title = findViewById(R.id.txtTitle);
                    SetTitleFont();
                    Title.setText("پل خواجو");
                    MatnPolKhajo();
                    btnBack = findViewById(R.id.btnBack);
                    btnBack.setOnClickListener(new View.OnClickListener() {
                        @Override
                        public void onClick(View v) {

                            setContentView(R.layout.activity_main_page);
                            ListData();
                            listView = findViewById(R.id.contentList);
                            DisplayList();

                            OpenActivityForShow();

                        }
                    });
                } else if (items.get(position) == "منارجنبان") {

                    setContentView(R.layout.activity_si_o_se_pol);
                    Image = findViewById(R.id.imageViewMain);

                    Image.setImageResource(R.drawable.monarj);

                    ImageEnd = findViewById(R.id.imageEnd);
                    ImageEnd.setImageResource(R.drawable.monarjend);
                    Title = findViewById(R.id.txtTitle);
                    SetTitleFont();
                    Title.setText("منارجنبان");
                    MatnMonarJonban();
                    btnBack = findViewById(R.id.btnBack);
                    btnBack.setOnClickListener(new View.OnClickListener() {
                        @Override
                        public void onClick(View v) {

                            setContentView(R.layout.activity_main_page);
                            ListData();
                            listView = findViewById(R.id.contentList);
                            DisplayList();

                            OpenActivityForShow();

                        }
                    });
                } else if (items.get(position) == "عالی قاپو") {

                    setContentView(R.layout.activity_si_o_se_pol);
                    Image = findViewById(R.id.imageViewMain);

                    Image.setImageResource(R.drawable.aalighapoo);

                    ImageEnd = findViewById(R.id.imageEnd);
                    ImageEnd.setImageResource(R.drawable.aalighapooend);
                    Title = findViewById(R.id.txtTitle);
                    SetTitleFont();
                    Title.setText("عالی قاپو");
                    MatnAlighapoo();
                    btnBack = findViewById(R.id.btnBack);
                    btnBack.setOnClickListener(new View.OnClickListener() {
                        @Override
                        public void onClick(View v) {

                            setContentView(R.layout.activity_main_page);
                            ListData();
                            listView = findViewById(R.id.contentList);
                            DisplayList();

                            OpenActivityForShow();

                        }
                    });
                } else if (items.get(position) == "بازار قیصریه") {

                    setContentView(R.layout.activity_si_o_se_pol);
                    Image = findViewById(R.id.imageViewMain);
                    Image.setImageResource(R.drawable.baazargh);
                    ImageEnd = findViewById(R.id.imageEnd);
                    ImageEnd.setImageResource(R.drawable.baazarghend);
                    Title = findViewById(R.id.txtTitle);
                    SetTitleFont();
                    Title.setText("بازار قیصریه");
                    MatnBazaarGheysar();
                    btnBack = findViewById(R.id.btnBack);
                    btnBack.setOnClickListener(new View.OnClickListener() {
                        @Override
                        public void onClick(View v) {

                            setContentView(R.layout.activity_main_page);
                            ListData();
                            listView = findViewById(R.id.contentList);
                            DisplayList();

                            OpenActivityForShow();

                        }
                    });
                } else if (items.get(position) == "صنایع دستی") {

                    setContentView(R.layout.activity_sanaye_dasti);
                    SetTitleFontSanayeDasti();
                    MatnKhatam();
                    MatnGhalam();
                    MatnMes();
                    btnBack = findViewById(R.id.btnBack1);
                    btnBack.setOnClickListener(new View.OnClickListener() {
                        @Override
                        public void onClick(View v) {

                            setContentView(R.layout.activity_main_page);
                            ListData();
                            listView = findViewById(R.id.contentList);
                            DisplayList();

                            OpenActivityForShow();

                        }
                    });
                } else if (items.get(position) == "حمل و نقل(مترو)") {

                    setContentView(R.layout.activity_si_o_se_pol);
                    Image = findViewById(R.id.imageViewMain);
                    Image.setImageResource(R.drawable.metoo);
                    ImageEnd = findViewById(R.id.imageEnd);
                    ImageEnd.setImageResource(R.drawable.map_metroo);
                    Title = findViewById(R.id.txtTitle);
                    SetTitleFont();
                    Title.setText("متروی اصفهان");
                    MatnMetroo();
                    btnBack = findViewById(R.id.btnBack);
                    btnBack.setOnClickListener(new View.OnClickListener() {
                        @Override
                        public void onClick(View v) {

                            setContentView(R.layout.activity_main_page);
                            ListData();
                            listView = findViewById(R.id.contentList);
                            DisplayList();

                            OpenActivityForShow();

                        }
                    });
                }
            }
        });
    }


    private void DisplayList() {
        adapter = new ArrayAdapter<String>(this, android.R.layout.simple_expandable_list_item_1, items);
        adapter.notifyDataSetChanged();
        listView.setAdapter(adapter);
    }

    @Override
    public boolean onCreateOptionsMenu(Menu menu) {
        getMenuInflater().inflate(R.menu.main_menu, menu);
        menu.add("درباره ما").setOnMenuItemClickListener(new MenuItem.OnMenuItemClickListener() {
            @Override
            public boolean onMenuItemClick(MenuItem item) {

                setContentView(R.layout.activity_about_us);
                Button back = findViewById(R.id.btnBackAbout);
                TextView aboutUs = findViewById(R.id.txtAboutUs);
                SetAboutFont();
                webView = findViewById(R.id.webView);
                String siteUrl = "https://moradi20.ir";
                webView.loadUrl(siteUrl);


                back.setOnClickListener(new View.OnClickListener() {
                    @Override
                    public void onClick(View v) {
                        setContentView(R.layout.activity_main_page);
                        ListData();
                        listView = findViewById(R.id.contentList);
                        DisplayList();
                        OpenActivityForShow();
                    }
                });

                return false;
            }
        });
        menu.add("تماس با ما").setOnMenuItemClickListener(new MenuItem.OnMenuItemClickListener() {
            @Override
            public boolean onMenuItemClick(MenuItem item) {
                setContentView(R.layout.activity_login);
                Button submit = findViewById(R.id.btnSubmit);

                IntentPage();

                return false;
            }
        });

        menu.add("گالری تصاویر").setOnMenuItemClickListener(new MenuItem.OnMenuItemClickListener() {
            @Override
            public boolean onMenuItemClick(MenuItem item) {
                setContentView(R.layout.activity_images);
                Button back = findViewById(R.id.btnBackImages);
                back.setOnClickListener(new View.OnClickListener() {
                    @Override
                    public void onClick(View v) {
                        setContentView(R.layout.activity_main_page);
                        ListData();
                        listView = findViewById(R.id.contentList);
                        DisplayList();
                        OpenActivityForShow();
                    }
                });
                return false;
            }
        });
        menu.add("خروج").setOnMenuItemClickListener(new MenuItem.OnMenuItemClickListener() {
            @Override
            public boolean onMenuItemClick(MenuItem item) {
              System.exit(0);

                return false;
            }
        });
        return super.onCreateOptionsMenu(menu);
    }

    private void ListData() {
        items = new ArrayList<>();
        items.add("سی و سه پل");
        items.add("پل خواجو");
        items.add("منارجنبان");
        items.add("عالی قاپو");
        items.add("بازار قیصریه");
        items.add("حمل و نقل(مترو)");
        items.add("صنایع دستی");
    }


    private void MatnSiOSePol() {
        Matn = findViewById(R.id.txtMatn1);
        SetFont();
        Matn.setText("اگر بخواهیم اصفهان را با یک نماد تعریف کنیم، بی\u200Cشک سی و سه پل در رده\u200Cهای اول لیست جا می\u200Cگیرد. سی و سه پل (۳۳ پل یا پل الله وردی خان)، یک پل قوسی سنگی دوطبقه و تقریبا ۳۰۰ متر است. این پل یکی از یازده پل اصفهان است که از رودخانه زاینده\u200Cرود عبور می\u200Cکند. سی و سه پل به دلیل وسعت، موقعیت مرکزی و معماری برجسته\u200Cاش معروف\u200Cترین پل اصفهان است. این پل مرکز تفریحات شبانه شهری است که هم ایرانیان و هم گردشگران خارجی را به خود جذب می\u200Cکند. از جاذبه\u200Cهای گردشگری نزدیک سی و سه پل می\u200Cتوان به چهلستون، کلیسای وانک، کاخ هشت بهشت، موزه تاریخ طبیعی اصفهان و مسجد جامع عباسی اشاره کرد که مورد توجه گردشگران بسیاری واقع شده است.\n" +
                "\nتاریخچه سی و سه پل\n" +
                "ساخت پل در سال ۱۵۹۹ در زمان شاه عباس آغاز شد و در سال ۱۶۰۲ به پایان رسید. این پل روی رودخانه زاینده رود ساخته شده است. با نظارت و هزینه الله وردی خان، از سرداران معروف شاه عباس صفوی اول، ارامنه در دوره صفویه جشن\u200Cهای خاصی را در کنار این پل برگزار می\u200Cکردند. در سال ۱۵۹۸ شاه عباس پایتخت امپراتوری خود را از قزوین به اصفهان منتقل کرد. ۵ پل از ۱۱ پل در زمان صفویه به عنوان وسیله عبور از رودخانه ساخته شده است.\n" +
                "در طول ۴۰۰ سال تاریخ پل، رودخانه خشک شد، اما سی و سه پل اهداف دیگری پیدا کرد. این مکان مکانی برای پیاده روی عصرگاهی، جلسات عمومی، رویدادها و یک نقطه مشاهده برای ورزش\u200Cهای آبی بود. سی و سه پل در زمان شکل گیری و توسعه اصفهان، یکی از محورهای اصلی ارتباطی در شهر بوده است و چهار باغ عباسی را به چهار باغ بالا و محله جلفا متصل می\u200Cکند. سی و سه پل، طولانی ترین پل روی زاینده رود اصفهان است.\n" +
                "سی و سه پل همانطور که از نامش پیداست دارای ۳۳ دهانه و ستون اصلی است. اما در ابتدا ۴۰ دهانه داشته، اما برخی از آنها به تدریج متروک شده\u200Cاند. از نام\u200Cهای دیگر این پل می\u200Cتوان به «پل جلفا» و «پل عباسی» اشاره کرد. در بخش داخلی پل، تصویرها و نگارگری\u200Cهایی نیز وجود داشته است که در گذر زمان از میان رفته است. مشهور است که در ملات سی و سه پل از سفیده تخم مرغ استفاده شده است و این موجب استحکام آن شده است. همچنین برخی بررسی\u200Cها نشان داده است که ستون\u200Cهای پل برای قرار گرفتن در آب، طراحی شده است و خشک شدن آب زاینده رود، ممکن است به استحکام آن آسیب بزند.\n");


    }

    private void MatnPolKhajo() {
        Matn = findViewById(R.id.txtMatn1);
        SetFont();
        Matn.setText("پل خواجو اصفهان در شرق سی\u200Cوسه\u200Cپل قرار دارد و از نظر استحکام، تقارن و سبک معماری، یکی از پل\u200Cهای منحصربه\u200Cفرد ایران به\u200Cحساب می\u200Cآید. این پل در عصر صفوی به\u200Cعنوان یکی از زیباترین پل\u200Cهای دنیا محسوب می\u200Cشد و به\u200Cخاطر معماری و تزیینات کاشی\u200Cکاری به کار رفته در آن، از سایر پل\u200Cهای زاینده\u200Cرود معروف\u200Cتر است. پل تاریخی خواجو به\u200Cعنوان یکی از جاهای دیدنی اصفهان، در تاریخ ۱۵ دی ۱۳۱۰ در فهرست آثار ملی ایران قرار گرفت." +
                "\nپل خواجو روی رودخانه زاینده\u200Cرود در شهر اصفهان قرار گرفته است و با سی و سه پل (پل الله وردی خان) حدود ۱۸۰۰ متر فاصله دارد. این پل در انتهای جنوبی چهارباغ خواجو و در انتهای شرقی خیابان کمال الدین اسماعیل اصفهانی خودنمایی می\u200Cکند.\n" +
                "\n" +
                "اگر قصد دارید با مترو خود را به پل خواجو برسانید، ایستگاه سی و سه پل نزدیک\u200Cترین ایستگاه مترو است که می\u200Cتوانید مسیر دو کیلومتری تا پل خواجو را پیاده طی کرده یا از تاکسی استفاده کنید." +
                "\nتاریخچه پل خواجو" +
                "\n" +
                "شاه عباس دوم صفوی در سال ۱۰۶۰ هجری قمری دستور ساخت پل خواجو را روی بقایای پل حسن بیک از دوره تیموری داد. بر اساس روایات، شاه عباس دوم به\u200Cمنظور ایجاد راه مواصلاتی بین محله خواجو و دروازه حسن آباد با تخت فولاد و راه شیراز، تصمیم به ساخت این پل گرفت که در ادامه قرار شد علاوه بر پل بتواند به\u200Cعنوان یک سد عمل کند.\n" +
                "\n" +
                "شاه عباس برای اینکه بتواند همراه با خانواده، اقامت کوتاهی روی این پل داشته باشد، محلی موسوم به شاه\u200Cنشین در وسط پل در نظر گرفت. در طول تاریخ، علاوه بر رفت و آمد از روی زاینده رود، از این پل برای تماشای مسابقه\u200Cهای قایقرانی، تفریح و خوش\u200Cگذرانی پادشاه و همراهیانش استفاده می\u200Cکردند.\n" +
                "\n" +
                "کتیبه\u200Cای در بخش جنوبى پل وجود دارد که نشان می\u200Cدهد پل خواجو در زمان سلطنت ناصرالدین شاه قاجار در سال ۱۲۹۰ هجرى مرمت شده است." +
                "پل خواجو را با نام\u200Cهای دیگری همچون بابا رکن\u200Cالدین، گبرها، حسن\u200Cآباد، شیراز و پل شاهی نیز می\u200Cنامیدند. علت نام\u200Cگذاری آن به پل بابا رکن\u200Cالدین، وجود بقعه بابا رکن\u200Cالدین در تخت فولاد بوده است. مجاورت آن با محله خواجو نیز باعث شد که به پل خواجو معروف شود. این پل در نزدیکی جاده اصفهان به شیراز قرار داشت و در مقطعی از تاریخ، با نام پل شیراز خوانده می\u200Cشد.\n" +
                "\n" +
                "از آنجا که گبرها برای رفتن به محله خود از این پل استفاده می\u200Cکردند، به پل گبرها نیز معروف بود. پل حسن آباد نیز یکی دیگر از اسامی آن بوده است؛ چراکه در روزگاران گذشته محله خواجو را با نام حسن آباد می\u200Cشناختند.\n" +
                "\n" +
                "همان طور که گفتیم شاه\u200Cعباس دوم در سال ۱۰۶۰ هجری قمری پل خواجو را بنا کرد و همین موضوع باعث شد که به پل شاهی معروف شود." +
                "پل خواجو یک شاهکار معماری از عصر صفویه به شمار می\u200Cرود که طبق برخی منابع معماری، کارکرد آن بی\u200Cشباهت به پل طبیعت تهران نبوده و به\u200Cجای اینکه فقط محلی برای گذر باشد، جایی فوق\u200Cالعاده برای توقف و لذت\u200Cبردن از محیط اطراف بوده است. این پل ۱۳۳ متر طول، ۱۲ متر عرض و ۷٫۵ متر معبر دارد و در ساخت آن از مصالحی همچون آجر، \u200Cسنگ و ساروج استفاده شده است.\n" +
                "\n" +
                "پل خواجو هم از نظر هیدرولیک و هم سازه\u200Cای در هماهنگی کامل با بستر طبیعی زمین است؛ به\u200Cطوری که پی پل خواجو به\u200Cعنوان سدی زیرزمینی در برابر دریاچه مخزن آب زیرزمینی اصفهان عمل می\u200Cکند. مضاف بر اینکه این پل باعث می\u200Cشود که رودخانه در بالادست، سفره آب زیرزمینی شهر را افزایش دهد و در پایین دست، مثل زهکشی برای زمین بستر شهر عمل کند.\n" +
                "\n" +
                "در آن روزگار، زیر پایه پل را به\u200Cصورت سرتاسری شمع قرار داده و پهنه غیرقابل نفوذی به وجود آورده و داخل آن ساروج ریخته\u200Cاند. علاوه بر این، دهانه\u200Cها و کانال\u200Cهای عبوری ایجاد کردند که در نتیجه آن انرژی ناشی از آب که در پایین\u200Cدست پل به هم می\u200Cرسد، از بین می\u200Cرود و حوضچه بسیار زیبایی شکل می\u200Cگیرد. ضمن اینکه برخورد جریان\u200Cهای متقاطع آب منجر به تشکیل حباب\u200Cها و متعاقبا افزایش اکسیژن آب می\u200Cشود؛ محیطی که برای پرورش ماهی مناسب بوده است." +
                "مهندسان عصر صفوی با احداث پل خواجو و ایجاد تاسیسات تاخیرانداز و بندها و... مشکل آب شهر اصفهان را حل کردند و در عین حال با شست\u200Cوشوی خاک و قابل کشت کردن زمین، باعث دوام و گسترش آبادانی شدند.\n" +
                "\n" +
                "شکل نوک تیز پایه\u200Cهای پل در بالادست باعث می\u200Cشوند که مثل یک آب\u200Cشکن، فشار آب رودخانه به پل را به حداقل برسانند و شکل پله\u200Cای پایه\u200Cها در پایین\u200Cدست این خاصیت را دارند که موقع سیلاب، آب از روی پایه\u200Cها جریان پیدا کند و به این ترتیب در اثر برخورد با پله\u200Cها، انرژی مخرب خود را از دست بدهد." +
                "شکل نوک تیز پایه\u200Cهای پل در بالادست باعث می\u200Cشوند که مثل یک آب\u200Cشکن عمل کنند" +
                "در بخش گذرگاه پل خواجو، طاق\u200Cهای آهنگ و گنبدهای عرقچین قرار دارد که از طاق\u200Cهای کهن ایرانی هستند و به باربری و پایداری بهتر پل کمک می\u200Cکنند.\n" +
                "\n" +
                "در طراحی پل خواجو از تقارن انعکاسی و تناسب استفاده شده است؛ به\u200Cطوری که کلیه جزییات با ریتم و آهنگ منظمی تکرار شده\u200C\u200Cاند و فضاهایی یک شکل و هم\u200Cاندازه با عملکرد یکسان دارند که بسیار زیبا و چشم\u200Cنواز است.");


    }

    private void MatnMonarJonban() {
        Matn = findViewById(R.id.txtMatn1);
        SetFont();
        Matn.setText("بعضی از مناره\u200Cها در ایران با وجود استحکام بالا، در جای خود تکان می\u200Cخورند و به همین دلیل به آن\u200Cها منارجنبان می\u200Cگویند. یکی از این مناره\u200Cهای جذاب و دیدنی، منارجنبان\u200C اصفهان است. این بنا در سال\u200Cهای دور، در دهکده\u200Cای به نام کارلادان ساخته شد. اکنون، این عمارت پیرامون منطقه\u200Cای به نام نصرآباد قرار دارد. این اثر تاریخی، بخشی از شهر اصفهان به حساب می\u200Cآید که استادان و کاشی\u200Cکاران ماهر و چیره\u200Cدست آن زمان، با کاشی\u200Cهایی ستاره\u200Cای شکل لاجوردی و کثیرالاضلاع فیروزه\u200Cای، آن را مزین کرده\u200Cاند." +
                "منارجنبان از عجایب ایران به شمار می\u200Cآید و حدود کیلومتر ۶ جاده اصفهان به طرف نجف\u200Cآباد، قسمت راست جاده، ساخته شده است. پیرامون این عمارت، اثر تاریخی\u200C دیگری به نام آتشگاه وجود دارد. برای دسترسی به این مکان می\u200Cتوانید از خودروی شخصی یا تاکسی\u200Cهای دربست و آنلاین استفاده کنید. برای دسترسی با خودروی شخصی، کافی است به خیابان آتشگاه بروید و پس از طی ۶ کیلومتر، به منارجنبان خواهید رسید. این مجموعه دارای پارکینگ است. " +
                "\n" +
                "تاریخچه\u200C منارجنبان اصفهان" +
                "\n" +
                "بر اساس مدارک موجود، منار\u200Cجنبان اصفهان در دوران فرمانروایی فردی بنام محمد خدابنده اولجایتو، در شهر اصفهان ساخته شد و میزبان مدفن عمو عبدالله\u200Cبن\u200Cمحمود صقلابی، یکی از عارفان خداپرست است. از همین رو منارجنبان را با نام آرامگاه شیخ امیرعبدالله نیز می\u200Cشناسند. روی سنگ قبر وی عدد ۷۱۶ حک شده است، عددی که نشان\u200Cدهنده سال ساخت آرامگاه او است. " +
                "عمارت تک ایوانی منارجنبان را در دوره ایلخانی ساخته\u200Cاند. طبق مدارک موجود، این بنا به روش مغول ساخته شده؛ اما ساختمان مناره\u200Cها حاکی از آن است که آن\u200Cها را در سال\u200Cهای آخر حکومت صفویان، به ایوان متصل کرده\u200Cاند." +
                "\n" +
                "معماری منارجنبان اصفهان" +
                "\n" +
                "مجموعه منارجنبان دارای چند بخش است:\n" +
                "\n" +
                "مناره\u200Cها: مناره\u200Cها مهم\u200Cترین بخش مجموعه هستند. هر مناره\u200C دارای ۹ متر عرض و ۱۷ متر ارتفاع است. در تزیین آن\u200Cها از کاشی\u200Cهای کثیرالاضلاع فیروزه\u200Cای رنگ و کاشی\u200Cهای لاجوردی ستاره چهار پر استفاده کرده\u200Cاند. ویژگی\u200C منحصر\u200Cبه\u200Cفرد این مناره\u200Cها، حرکت یکی از آن\u200Cها در پی تکان دادن مناره اولی است. \n" +
                "ایوان: ایوان مجموعه میزبان قبر شیخ امیرعبدالله است و ۱۰ متر از سطح زمین ارتفاع دارد. در ساخت ایوان از آجر استفاده کرده\u200Cاند و برای تزیین آن، کاشی\u200Cها و نقاشی\u200Cهایی درون گنبد کار شده\u200Cاند. در نزدیکی ایوان چند سنگ قبر سفید دیده می\u200Cشود که به\u200Cنظر می\u200Cرسد بازمانده\u200Cهایی هستند از قبرستان قدیمی که بنا روی آن ساخته شده است. با پلکانی مارپیچ می\u200Cتوان از ایوان به پشت بام و مناره\u200Cهای مجموعه دسترسی داشت که البته استفاده از آن برای بازدیدکنندگان ممنوع است. \n" +
                "چله\u200Cخانه: دو اتاقک در مجموعه قرار دارند که از آن\u200Cها با عنوان چله\u200Cخانه یاد می\u200Cشود. چله\u200Cخانه\u200Cها محل چله\u200Cنشینی عرفا بوده است. عارفان و زاهدان با اقامت ۴۰ روزه در این فضای ساده، ضمن کشیدن ریاضت با خدای خود خلوت می\u200Cکردند." +
                "\n" +
                "علت لرزش منارجنبان اصفهان " +
                "\n" +
                "با تکان یکی از مناره\u200Cها، مناره دوم و دیگر بخش\u200Cهای بنا نیز می\u200Cلرزد و این همان ویژگی منحصر\u200Cبه\u200Cفردی است که این مجموعه تاریخی را به یکی از جاذبه\u200Cهای اصفهان تبدیل کرده است. " +
                "ظاهرا در کشورهایی مانند عربستان و عراق نیز آثار تاریخی پیدا شده\u200Cاند که در جای خود، به حرکت درمی\u200Cآیند. اما بر اساس نظرات مهندسان علم فیزیک، دلیلی که می\u200Cتوان برای حرکت مناره\u200Cها بیان کرد، نظریه\u200C\u200C\u200C دوپلر (کریستیان دوپلر، ریاضیدان و فیزیکدان اتریشی است) یا تشدید است. این مناره\u200Cها، به\u200Cطور کل به یک\u200Cدیگر شبیه هستند و وزن چندان سنگینی ندارند. زمانی که یکی از مناره\u200Cها تکان داده می\u200Cشود، روی مناره\u200C دیگر خودبه\u200Cخود تاثیر می\u200Cگذارد و باعث حرکت آن می\u200Cشود. " +
                "برخی معتقدند منارجنبان اصفهان با دیگر مناره\u200Cهای جنبان تفاوت دارد؛ چراکه علاوه بر تکان خوردن مناره\u200Cها، بخش\u200Cهای دیگر این عمارت کهن نیز به لرزه درمی\u200Cآید.");
    }

    private void MatnAlighapoo() {
        Matn = findViewById(R.id.txtMatn1);
        SetFont();
        Matn.setText(
                "کاخ عالی قاپو در میدان نقش جهان اصفهان از زیباترین نمونه\u200Cهای معماری دوره صفویان به شمار می\u200Cآید. عمارت عالی قاپو با معماری برجسته و تزیینات قابل\u200Cتوجه از هنرمندان سرشناس ایرانی، توجه بسیاری از گردشگران داخلی و خارجی را به خود جلب می\u200Cکند. از مهم\u200Cترین بخش\u200Cهای کاخ عالی قاپو می\u200Cتوان به سر در ورودی کاخ، تالارهای مجلل، تالار موسیقی در بالاترین طبقه و آثار هنری برجسته در نقاط مختلف عمارت عالی قاپو اشاره کرد. پایه\u200Cهای اصلی این عمارت، بر چوب بنا شده\u200Cاند و همین بر جذابیت معماری کاخ عالی قاپو می\u200Cافزاید.\n" +
                        "\n" +
                        "از جالب\u200Cتوجه\u200Cترین جاذبه\u200Cها در سفر به اصفهان، کاخ عالی قاپو است. برای آشنایی با بنای کاخ و قسمت\u200Cهای مختلف عمارت عالی قاپو با ما همراه شوید. در این مقاله به معرفی کاخ عالی قاپوی اصفهان و بخش\u200Cهای مختلف آن می\u200Cپردازیم." +
                        "\n" +
                        "معرفی بنای عالی قاپو" +
                        "\n" +
                        "کاخ عالی قاپو از زیباترین بناهای تاریخی به جا مانده از دوران حکومت صفویان و از مشهورترین جاهای دیدنی اصفهان است. کاخ یا عمارت عالی قاپو در ضلع غربی میدان نقش جهان اصفهان و مقابل مسجد شیخ لطف الله قرار دارد. در گذشته از عمارت عالی قاپو با نام\u200Cهای «دولتخانه مبارکه نقش جهان» و «قصر دولتخانه» نیز یاد می\u200Cکردند. کاخ عالی قاپو ۱۸۰۰ متر مربع مساحت، ۶ طبقه و ۳۸ متر ارتفاع دارد. عالی\u200Cقاپو تنها بنایی است که نسبت به سایر بناهای پیرامون میدان پیش\u200Cآمدگی دارد و در زمان خود نمادی از قدرت حکومتی به شمار می\u200Cرفت و با معماری زیبا بر پایه چوب، از بزرگ\u200Cترین و باشکوه\u200Cترین بناهای آن دوران محسوب می\u200Cشد.\n" +
                        "\n" +
                        "سردر ورودی عمارت عالی قاپو در زمان صفویان، دروازه ورود به تمام بناهای سلطنتی در میدان نقش جهان بوده است. شاه عباس اول صفوی، به\u200Cمنظور نشان دادن قدرت و شکوه دولت خود، دستور به ساخت عمارت عالی قاپو داد. جلسات مهم حکومتی، استقبال از مهمانان خارجی و مراسم دولتی در این کاخ برگزار می\u200Cشد؛ همچنین بالکن این عمارت محلی برای اتراق شاه عباس و اطرافیان او در زمان برگزاری مسابقات چوگان و اسب\u200Cسواری در میدان نقش جهان و تماشای این مسابقات بود.\n" +
                        "\n" +
                        "عمارت عالی قاپو در زمان شاه عباس اول بسیار مورد احترام بود و عبور از در ورودی این بنا برای همگان میسر نبود. در بازدید از میدان نقش جهان اصفهان، این ساختمان ۶ طبقه توجه بسیاری از گردشگران را، از گذشته\u200Cهای دور تاکنون، جلب می\u200Cکند.\n" +
                        "\n" +
                        "کاخ عالی قاپو را با عنوان بلندترین کاخ عهد صفوی می\u200Cشناسند که با پلکانی باریک از طبقه همکف به طبقات بالاتر می\u200Cرسد. بالا رفتن از این پله\u200Cها به\u200Cدلیل ارتفاع بلند آن\u200Cها کمی سخت است؛ اما در پس آن ایوانی زیبا با ستون\u200Cهای چوبی قرار دارد که ارتفاعش به ۲۰ متر می\u200Cرسد و تماشای میدان نقش جهان از فراز آن بسیار لذت\u200Cبخش است. در این ایوان می\u200Cتوانید مسجد شیخ لطف الله را پیش رویتان، سر در قیصریه را در سمت چپ و مسجد شاه را در سمت راست ببینید. عمارت عالی قاپو از جالب توجه\u200Cترین بناهای تاریخی در میدان نقش جهان اصفهان به شمار می\u200Cرود." +
                        "\n" +
                        "تاریخچه عالی قاپو" +
                        "\n" +
                        "قدمت عمارت عالی قاپو به حکومت صفویان در ایران باز می\u200Cگردد، زمانی که اصفهان پایتخت فرماندهی بود. بر اساس برخی مستندات تاریخی، کاخ عالی\u200C قاپو روی کاخی از عهد تیموریان احداث شد که قدمت آن به سال ۱۰۰۰ تا ۱۰۰۶ هجری قمری می\u200Cرسید.\n" +
                        "\n" +
                        "عمارت عالی قاپو در حدود سال ۱۰۵۴ هجری قمری (بین سال\u200Cهای ۹۷۱ تا ۹۷۷ هجری شمسی) به دستور شاه عباس اول ساخته شد که از مقتدرترین پادشاهان ایران بوده است؛ البته تکمیل ظرایف و تزیینات عمارت عالی قاپو پس از مرگ شاه عباس اول صورت گرفت. شاه صفوی، سفرا و شخصیت\u200Cهای عالیقدر را در این کاخ به حضور می\u200Cپذیرفت. ساخت کامل بنای عالی قاپو و تکمیل تزیینات داخلی این عمارت در طول پادشاهی شاه عباس اول، شاه عباس دوم و شاه سلطان حسین صورت گرفته است. این فاصله زمانی که مراحل ساخت بنا به\u200Cصورت متناوب در آن جریان داشته است، نزدیک به ۱۰۰ سال طول کشیده است. پایه\u200Cگذاری بنا بیشتر به زمان شاه عباس اول و دوم و مرمت و تزیین آن به زمان پادشاهی شاه سلطان حسین باز می\u200Cگردد. صائب تبریزی در پایان بنای این تالار، قصیده قرایی سروده و تقدیم به شاه عباس کرده که ابیاتی از آن این\u200Cچنین است:" +
                        "\n" +
                        "منت ایزد را که از لطف خدای مستعان     عالم افسرده شد از باد نوروزی جوان\n" +
                        "\n" +
                        "جوهر تیغ شجاعت، شاه عباس آنکه هست      نور عالمگیری از سیمای اقبالش عیان\n" +
                        "\n" +
                        "چون شد از تعمیر دل\u200Cها فارغ از توفیق حق      کرد تالار فلک قدری بنا در اصفهان\n" +
                        "\n" +
                        "گرچه چندین نقش موزون داشت در هر گوشه\u200Cای    زین عمارت شد بلند آوازه نقش جهان\n" +
                        "\n" +
                        "تا بود خورشید تابان شمسه\u200C طاق سپهر       جلوه\u200Cگاه سایه\u200C حق باد این عالی مکان" +
                        "\n" +
                        "در تزیینات داخلی بنای عمارت عالی قاپو، آثار هنری برجسته خوش\u200Cنویسی و مینیاتور از دوران بعد از شاه عباس اول نیز دیده می\u200Cشوند که نشان از تکمیل کاخ قاپو پس از مرگ وی دارد. با توجه به هدف شاه عباس از ساخت عمارت عالی قاپو که استفاده از آن به\u200Cعنوان «قصر دولتخانه» بود، معماری بنا توسط برجسته\u200Cترین معماران ایرانی طراحی شد. این اقدامات پس از جابه\u200Cجایی پایتخت از شهر قزوین به اصفهان انجام شدند.\n" +
                        "\n" +
                        "پیش از تغییر پایتخت در دوره صفویان، بنایی به همین نام در شهر قزوین، محل استقرار صفویان وجود داشت؛ به همین دلیل و به اعتقاد مورخان، کاخ عالی قاپوی اصفهان نمونه مجلل\u200Cتر از کاخ عالی قاپو در خیابان سپه قزوین است که شاه عباس اول به\u200Cمنظور نشان دادن عظمت دولت خود و اقتدارش تصمیم به ساخت آن گرفت." +
                        "بنای اولیه با سرعت زیادی در زمان شاه عباس به پایان رسید؛ اما می\u200Cتوان مراحل تکمیل این عمارت را به دوره\u200Cهای مختلف تقسیم کرد، که کارشناسان از روی کتیبه\u200Cها و اشعار نوشته شده داخل بنا به این اطلاعات دست پیدا کرده\u200Cاند. به\u200Cعنوان مثال، وجود کتیبه\u200Cای به خط نستعلیق در زمان شاه سلطان حسین نشان از آن دارد که تزیینات طبقه سوم در زمان این آخرین پادشاه صفوی اضافه یا مرمت\u200C شده \u200Cاست.\n" +
                        "\n" +
                        "در ابتدای ساخت عالی قاپو و در مرحله اول، این بنا تنها به\u200Cمنظور برقراری مسیر ارتباطی میان باغ نقش جهان و دیگر کاخ\u200Cهای اطراف ساخته شد و فقط پادشاه و درباریان برای انجام امور تشریفاتی، استقبال از مهمانان خارجی و انجام برخی امور اداری از آن استفاده می\u200Cکردند. البته فضایی اختصاصی برای استراحت و زندگی شاه و امکانات مناسب در عالی قاپو ساخته بودند. بازار اطراف عالی قاپو در ابتدا تنها یک طبقه بود و ورودی عمارت عالی قاپو به مغازه\u200Cها اشراف داشت.\n" +
                        "\n" +
                        "با گسترش شهر اصفهان و افزایش جمعیت ساکن در این شهر و مهاجرت از آبادی\u200Cهای اطراف به پایتخت، بر اهمیت مقر حکومت نیز افزوده شد و به همین منظور، بر تعداد طبقه\u200Cهای عمارت عالی قاپو افزودند. در سال ۱۰۵۳ هجری قمری در زمان سلطنت شاه\u200C عباس دوم، ایوانی با ۱۸ ستون چوبی به ارتفاع ۱۰ متر به طبقه سوم کاخ عالی\u200Cقاپو اضافه\u200C شد. ستون\u200Cهای الحاقی با آینه پوشانده و سقف آن با صفحات بزرگ نقاشی تزیین شدند. دیوارهای ایوان دارای دو پوشش تزیینی بود که اولی در زمان شاه\u200C عباس دوم و دومی در زمان شاه سلطان حسین به آن الحاق شد. از فراز آخرین طبقه کاخ عالی\u200Cقاپو و ایوان باشکوه آن، شاهان صفوی و مهمانان آن\u200Cها به تماشای بازی چوگان، چراغانی، آتش\u200Cبازی و نمایش\u200Cهای میدانی می\u200Cنشستند. وسعت این ایوان ستون\u200Cدار حدود ۴۸۰ مترمربع است و کف آن با تیرهای چوبی، شناژبندی شده که به استحکام بنا افزوده است. \n" +
                        "\n" +
                        "با این تغییرات، شکل ظاهری ساختمان تفاوت\u200Cهای زیادی کرد و به\u200Cشکل امروزی آن نزدیک شد. ورودی مجلل امروزی در این زمان بنا شد و از شکل ساده\u200Cاش در آمد. بر تعداد طبقات و اتاق\u200Cهای کاخ نیز افزودند. این دوره را می\u200Cتوان دوران طلایی صفویان نامید که در اوج قدرت، شهرت و محبوبیت قرار داشتند.\n" +
                        "\n" +
                        "پس از آن، تصمیم به افزایش امکانات رفاهی کاخ عالی قاپو برای اقامت مهمانان گرفتند و تالار موسیقی نیز در آخرین طبقه به عمارت عالی قاپو اضافه شد. سالن موسیقی از نظر معماری تفاوت\u200Cهایی با دیگر قسمت\u200Cهای کاخ دارد و داخل آن تزیینات بسیار زیبایی تعبیه شده است. پس از تغییرات بنا، ایوان مشرف به باغ را نیز گسترش دادند تا برای تماشای رویدادها و مراسم و مسابقات داخل میدان، فضای بیشتری برای تماشا وجود داشته باشد، به همین دلیل ایوان را تا هفت متر از دکان\u200Cهای بازار جلوتر بردند و سپس بخش ورودی عمارت را نیز وسعت دادند تا فضای کافی برای استقبال از مهمانان و رژه\u200Cهای تشریفاتی به وجود بیاید." +
                        "در نهایت ۱۸ ستون ایوان کاخ را بر پا و سقفی چوبی بر آن تعبیه کردند. راه پله\u200Cای بلند و باریک، دسترسی به این ایوان را میسر می\u200Cکرد. برای سیستم آب رسانی به کاخ عالی قاپو نیز حوضی مسی در ایوان قرار دادند تا راهی برای انتقال آب به بالای کاخ باشد. بنای عالی قاپو از کامل\u200Cترین عمارت\u200Cهای پادشاهی در زمان خود محسوب می\u200Cشود.\n" +
                        "\n" +
                        "در طول تاریخ به\u200Cدلیل جنگ\u200Cها و عوامل طبیعی مختلف، خسارت\u200Cهای فراوانی به عمارت عالی قاپو وارد شد. حمله افغان\u200Cها، جنگ\u200Cهای داخلی، انتقال پایتخت از اصفهان و بی\u200Cتوجهی پادشاهان صفوی پس از شاه عباس به این عمارت، از عوامل تخریب بعضی قسمت\u200Cها و آسیب به بنای کاخ عالی قاپو بوده\u200Cاند.\n" +
                        "\n" +
                        "در دوره قاجار عالی\u200Cقاپو چند سال محل سکونت و کار ظل\u200Cالسلطان بود و او تغييراتی در کتیبه\u200Cهای آن داد. کتیبه\u200Cهای جبهه شرقی بنا و الواح خطی سردر ورودی مبین همین مطلب است که طی اشعاری به تعميرات سال ۱۲۷۴ اشاره می\u200Cکند.\n" +
                        "\n" +
                        "در طول سال\u200Cهای اخیر نیز مرمت بخش\u200Cهای مختلف کاخ عالی قاپو ادامه داشته است و در سال ۱۳۸۴، داربست\u200Cهایی را برای انجام عملیات تقویت استحکام بنا، مرمت و نظافت نمای عمارت و بازسازی بخش\u200Cهای تخریب شده نصب کردند. مرمت بنای عالی قاپو ۱۲ سال به طول انجامید و سپس داربست\u200Cها برداشته شدند، اما کار بازسازی تزیینات داخلی و بخش\u200Cهای دیگر هم\u200Cچنان ادامه دارد. " +
                        "\n\n" +
                        "کاخ عالی قاپو کجاست؟" +
                        "\n" +
                        "کاخ عالی قاپو در شهر اصفهان و در ضلع غربی میدان نقش جهان قرار دارد. میدان نقش جهان در مرکز شهر اصفهان و نزدیک به شمال این شهر قرار گرفته است. برای رسیدن به عمارت عالی قاپو باید به\u200Cسمت میدان نقش جهان بروید.");
    }

    private void MatnBazaarGheysar() {
        Matn = findViewById(R.id.txtMatn1);
        SetFont();
        Matn.setText("بازارها از جذاب\u200Cترین جاهای دیدنی هر شهر هستند. در بازار می\u200Cتوان ترکیبی از تاریخ و فرهنگ و هنر را مشاهده کرد. به\u200Cخصوص در شهرهایی تاریخی مانند اصفهان، گشت\u200Cو\u200Cگذار در بازار می\u200Cتواند تجربه\u200Cای فراموش\u200Cناشدنی را رقم بزند. بازار قیصریه یکی از این نمونه\u200Cها است." +
                "\n" +
                "معرفی بازار قیصریه" +
                "\n" +
                "بازار قیصریه یکی از معروف\u200Cترین بازارهای تاریخی ایران و جاهای دیدنی اصفهان است و به بازار شاهى نیز شهرت دارد. این بازار از سردر قیصریه شروع، به بازار چیت\u200Cساز\u200Cها و از آنجا به بازار دارالشفا منتهى می\u200Cشود. بازار قیصریه یکی از مراکز مشهور صنایع دستی به شمار می\u200Cآید. این بازار از بزرگ\u200Cترین و مجلل\u200Cترین مرکز خریدوفروش در دوران صفویه بوده است. به\u200Cطور کلی بازار سرپوشیده اصفهان چند کیلومتر طول دارد که هر بخش آن کالای ویژه\u200Cای تولید و فروخته می\u200Cشود. بازار بزرگ اصفهان که بازار قیصریه بخشی از آن است، درب\u200Cهای ورودی مختلفی داشته است.\n" +
                "(در این بازار مانند قدیم همچنان پارچه\u200Cهاى گوناگون و قلمکارهاى اصفهانى و غیره نیز به فروش می\u200Cرسد.)" +
                "\n" +
                "بازار قیصریه کجاست؟" +
                "\n" +
                "بازار قیصریه در شمال میدان نقش جهان قرار دارد. برای دسترسی می\u200Cتوانید از خودروی شخصی یا وسایل نقلیه عمومی استفاده کنید. ایستگاه\u200Cهای اتوبوس و متروی میدان امام حسین در فاصله نسبتا مناسبی از میدان نقش جهان قرار دارند و مسافت باقی\u200Cمانده از آن\u200Cها تا مقصد را می\u200Cتوانید با تاکسی طی کنید یا پیاده بروید. اگر قصد دارید با خودروی شخصی راهی این مکان شوید، باید خود را به خیابان سپه یا خیابان حافظ برسانید. خوشبختانه تعدادی پارکینگ در خیابان\u200Cهای اطراف نقش جهان وجود دارد. " +
                "\n" +
                "تاریخچه بازار قیصریه" +
                "\n" +
                "بازار قیصریه با دستور شاه عباس اول بین سال\u200Cهای ۱۰۱۱ تا ۱۰۲۹ ساخته شد. این بازار در دوره صفویه مرکز فروش پارچه و فرش\u200Cهای گران\u200Cبها بوده و شرکت\u200Cهای تجاری خارجی نیز در آن حجره\u200Cهایی داشته\u200Cاند. بازار قیصریه قسمت اصفهان جدید دوره صفویه را به شهر سلجوقی میدان کهنه آن روزگار (میدان قیام فعلی) متصل می\u200Cکرد." +
                "گفته شده قیصریه از واژه قیصر یا سزار مشتق شده است. قیصریه عموما به راسته\u200Cای از بازار گفته می\u200Cشد که در آن کالاهای سبک وزن و گرانقیمت لوکس به فروش می\u200Cرسید. این قسمت توسط حکومت یا بازرگانان ثروتمند ساخته می\u200Cشد و به\u200Cدلیل توان مالی پیشه\u200Cوران قیصریه\u200C، این قسمت از بازار به\u200Cلحاظ ویژگی\u200Cهای معماری و تزیینات غنی\u200Cتر و پرکار\u200Cتر از سایر قسمت\u200Cها بود و هندسی\u200Cتر ساخته می\u200Cشد. قیصریه\u200Cها به خاطر وجود همین تزیینات غنی و سازندگان معتبرشان، بازار شاهی یا قیصریه خوانده می\u200Cشدند." +
                "\n" +
                "قدیمى\u200C\u200Cترین توصیفى که از بازار اصفهان به جا مانده است، شرحى است از قرن چهارم هجرى قمرى (دوران دیالمه)، در کتاب رساله محاسن اصفهان تحت عنوان بازار جورین که مى\u200C\u200Cگوید:" +
                "\n" +
                "بازارى بود بر دروازه خور (خورشید) که یکى از چهار دروازه\u200C مشهور اصفهان در آن زمان بوده و در فصل نوروز عامه \u200Cمردم اصفهان با انواع خوردنى\u200Cها و آشامیدنى\u200Cها و آلات و ادوات موسیقى یکى دو ماه را در آن محل به تفریح و عیش و عشرت مى\u200C\u200C\u200C\u200Cگذراندند و بالطبع براى احتیاج این جمعیت از اغذیه، البسه و غیره بازارهایى برپا مى\u200Cکردند و طوافان و بازاریان انواع نعمت\u200Cها را در آنجا گرد مى\u200Cآورند." +
                "\n" +
                "سردر بازار قیصریه که در شمال میدان امام واقع است، یکی از نفیس\u200Cترین نقاشی\u200Cهای مربوط به دوران صفویه را نشان می\u200Cدهد. این سردر با شکلی قوس مانند با استفاده از کاشی\u200Cکارى مجلل و باشکوه و نقاشی\u200Cهای رنگ باخته صفوی آراسته شده است و ورودی بازار قیصریه محسوب می\u200Cشود. سردر قیصریه در گذشته سه طبقه داشت؛ اما امروزه از طبقه\u200C سوم که نقاره\u200Cخانه بود و در آن اوقات روز اعلام می\u200Cشد، اثری نیست. این بنا از روی نمونه\u200C بنای دیگری در شهر قیصریه ساخته شده است و به همین دلیل این نام را برایش انتخاب کرده\u200Cاند. سردر قیصریه در ۱۵ دی ماه ۱۳۱۰ به شماره\u200Cی ۱۰۳ در فهرست آثار ملی ایران به ثبت رسید و به\u200Cعنوان بخشی از میدان نقش جهان، در فهرست میراث جهانی یونسکو قرار دارد. ");
    }

    private void MatnMes() {
        Matn = findViewById(R.id.txtMatnMes);
        SetFont();
        Matn.setText("مسگری یکی از صنایع دستی قدیمی ایرانی با قدمتی از پنج هزار سال قبل است و اشیا و ظروف مسی دست\u200Cساز بسیاری از گذشته\u200Cهای دور، هم\u200Cاکنون در موزه\u200Cها قابل\u200Cمشاهده هستند. گفته می\u200Cشود که اولین فلز کشف شده به دست انسان فلز مس بوده است و اولین فلزکاران نیز ایرانیان بوده\u200Cاند.\n" +
                "\n" +
                "مسگری در شهرهای اصفهان، زنجان، کاشان، کرمان و شیراز رواج دارد و در بیشتر این شهرها بازاری با عنوان بازار مسگرها دیده می\u200Cشود. جالب است بدانید که کشف دو کوره ذوب فلز در محوطه سه هزار ساله «اسپیدژ» در سیستان و بلوچستان نشان داد که مردم این منطقه از هزاران سال قبل به هنر مسگری و فلزکاری می\u200Cپرداختند.\n" +
                "\n" +
                "مسگری در سال\u200Cهای اخیر با ترکیب با دیگر هنرهای ایرانی دوباره مورد توجه قرار گرفته است. در ادامه دو هنر بدیع مسگری را به شما معرفی خواهیم کرد." +
                "\n" +
                "مس و خاتم  یکی از صنایع دستی نسبتا جدید اصفهان است که از تلفیق هنر مسگری و خاتم سازی به وجود آمده است. همان طور که پیش\u200Cتر گفتیم در خاتم کاری از چوب و استخوان استفاده می\u200Cشود و تمام سطح جسم موردنظر را با نقوش هندسی پر می\u200Cکنند. برای خاتم کاری روی مس در ابتدا ظرف مسی موردنظر توسط استاد مسگر آماده شده و سپس بخش\u200Cهایی از آن با قطعات خاتم کاری پوشانده می\u200Cشود." +
                "\n");
    }

    private void MatnKhatam() {
        Matn = findViewById(R.id.txtMatnKhatam);
        SetFont();
        Matn.setText("خاتم کاری یکی از اصیل\u200Cترین و نفیس\u200Cترین صنایع دستی اصفهان با قدمتی از صدها سال قبل است و اوج درخشش آن به زمان حکومت پادشاهان صفوی بازمی\u200Cگردد؛ زمانی که درهای کاخ\u200Cها، رحل\u200Cهای قرآن و صندوق\u200Cهای مقابر، مزین به این هنر زیبای دست بوده\u200Cاند.\n" +
                "\n" +
                "درباره خاستگاه اصلی خاتم کاری اطلاعات کافی در دسترس نیست؛ اما روایت\u200Cهای زیادی خاستگاه خاتم کاری را شیراز می\u200Cدانند و گفته می\u200Cشود که این هنر در دوره صفویه به اصفهان منتقل شد و در این شهر به\u200Cعنوان پیشه به تولید انبوه رسید. در دائره\u200Cالمعارف فارسی درباره خاتم کاری آمده است:" +
                "\n" +
                "زمان آغاز این هنر دانسته نیست و آنچه درباره آن گفته می\u200Cشود، با افسانه همراه است. برخی از استادان خاتم\u200Cساز هنوز بر این عقیده\u200Cاند که هنر خاتم\u200Cسازی معجزه ابراهیم پیامبر است." +
                "\n" +
                "خاتم سازی یا خاتم کاری روی اشیای گوناگون در طرح\u200Cها و اندازه\u200Cهای مختلف انجام می\u200Cشود. در خاتم کاری ابتدا جسم موردنظر از جنس چوب آبنوس، فوفل، گردو، بقم، عناب، افرا، نارنج، کیکم و شمشاد (با رنگ\u200Cهای مختلف از جمله سیاه، طیف قهوه\u200Cای از تیره به روشن، سفید، زرد و غیره) ساخته می\u200Cشود. بعضی از استادکاران خاتم کاری از استخوان شتر، گاو، اسب، صدف و عاج فیل نیز استفاده می\u200Cکنند.\n" +
                "\n" +
                "در مرحله بعد چندضلعی\u200Cهای منظم با تعداد اضلاع متفاوت (پنج، ۶، هفت، هشت یا ۱۰ ضلعی) و از جنس چوب\u200Cهای ذکر شده ساخته می\u200Cشوند و با دقت و ظرافت فراوان روی طرح موردنظر قرار می\u200Cگیرند. چسب مورد استفاده در خاتم کاری از نوع گرم یا سرد است و بسته به نظر استاد خاتم کار از سریش یا چسب سفید استفاده می\u200Cشود. پس از قرارگیری این چند ضلعی\u200Cهای چوبی و چسباندن آن\u200Cها، پره به دست آمده را با نخ می\u200Cبندند و این کار را آن\u200Cقدر ادامه می\u200Cدهند تا طرح کامل شود. پس از اتمام کار، جسم خاتم کاری شده را رنگ یا روغن کاری می\u200Cکنند. \n" +
                "\n" +
                "مراحل اجرای خاتم سازی چه روی چوب، چه استخوان و چه فلز مشکل و زمان\u200Cبر است و از ابتدا تا انتها شامل بیش از ۴۰۰ مرحله می\u200Cشود. از خاتم در تهیه محصولات مختلفی مانند قاب عکس، جعبه سیگار، عصا، پیپ، جعبه لوازم آرایش، جاکلیدی، جاقلمی و جلد آلبوم استفاده می\u200Cشود. مرغوبیت یک خاتم خوب به ریز نقشی و منظم بودن طرح بستگی دارد. مهم\u200Cترین مراکز خاتم\u200Cسازی در ایران، اصفهان، شیراز و تهران هستند." +
                "\n");
    }

    private void MatnGhalam() {
        Matn = findViewById(R.id.txtMatnGhalam);
        SetFont();
        Matn.setText("قلم زنی یکی از مشهورترین و قدیمی\u200Cترین صنایع دستی اصفهان است که در شهرهای شیراز و تبریز نیز رونق دارد و و در اماکن متبرکه و ضریح بزرگان دیده می\u200Cشود. قلم زنی در حقیقت نوعی حکاکی ظریف روی فلزات (مس، طلا، نقره و برنج) است. پیشینه این هنر به زمان سکاها یا سیتها از نژاد آریایی\u200Cها نسبت داده می\u200Cشود." +
                "\n" +
                "امروزه برای قلم زنی در ابتدا داخل یا زیر ظرف مورد نظر را از محلول قیر و گچ پر می\u200Cکنند تا در حین کار، سر و صدای قلم کمتر به گوش برسد و همچنین ظرف سوراخ نشود. سپس هنرمند قلم زن با استفاده از ابزاری چون قلم\u200Cهای مخصوص و چکش، طرح مورد نظر خود را روی ظرف اجرا می\u200Cکند و به برجسته\u200Cسازی و سه\u200Cبعدی کردن جزئیات طرح می\u200Cپردازد. پس از ایجاد نقش\u200Cها قیر را جدا می\u200Cکنند و روی شیارها گرده زغال می\u200Cریزند و در مرحله بعد روی ظرف را با روغن جلای سیاه می\u200Cپوشانند. به این ترتیب نقش\u200Cهای قلم\u200Cزده شده به\u200Cشکل خط\u200Cهایی تیره و مشخص دیده می\u200Cشود" +
                "\n");
    }

    private void MatnMetroo() {
        Matn = findViewById(R.id.txtMatn1);
        SetFont();
        Matn.setText("طرح متروی اصفهان یکی از اولین ایده\u200Cهای ساخت قطار شهری است که در ایران مطرح شد؛ اما متاسفانه به\u200Cدلایل مختلف علی\u200Cالخصوص تاریخی\u200Cبودن این شهر و وجود آثار باستانی زیاد در آن، اجرا و پیاده\u200Cسازی آن، با مسائل و مشکلات فراوانی روبه\u200Cرو شد. چراکه این امکان وجود داشت که لرزش\u200Cهای ایجادشده در هنگام عبور مترو از زیر مناطق تاریخی و حفاری در این بخش\u200Cها، آسیب جدی به آن\u200Cها وارد کند." +
                "\n" +
                "با وجود همه این مسائل در حال حاضر بخشی از متروی اصفهان در حال ارائه خدمات به مسافران است و سایر خطوط آن در حال ساخت و یا طراحی است." +
                "\n" +
                "طبق برنامه\u200Cریزی\u200Cهای انجام شده برای خطوط متروی اصفهان، به\u200Cمنظور پوشش کامل درون\u200Cشهری، ۳ خط و برای پوشش برون\u200Cشهری، ۴ خط طراحی شده است. اما متاسفانه فقط یکی از این خطوط فعال و به مسافران شهری، سرویس\u200Cدهی می\u200Cکند.");
    }

    private void SetFont() {
        Typeface tf = Typeface.createFromAsset(getAssets(), "Vazirmatn-Regular.ttf");
        Matn.setTypeface(tf);
    }

    private void SetTitleFont() {
        Typeface tf = Typeface.createFromAsset(getAssets(), "Vazirmatn-Medium.ttf");
        Title.setTypeface(tf);
    }

    private void SetAboutFont() {

        Typeface tf = Typeface.createFromAsset(getAssets(), "Vazirmatn-Medium.ttf");
        TextView aboutUs = findViewById(R.id.txtAboutUs);
        TextView aboutCode = findViewById(R.id.txtAboutCode);
        TextView aboutDars = findViewById(R.id.txtAboutDars);
        TextView aboutPhone = findViewById(R.id.txtAboutPhone);
        TextView aboutProgrammer = findViewById(R.id.txtAboutProgrammer);
        TextView aboutStCode = findViewById(R.id.txtAboutStudentCode);
        TextView aboutOstad = findViewById(R.id.ostaaad);
        aboutCode.setTypeface(tf);
        aboutDars.setTypeface(tf);
        aboutPhone.setTypeface(tf);
        aboutProgrammer.setTypeface(tf);
        aboutStCode.setTypeface(tf);
        aboutOstad.setTypeface(tf);
        aboutUs.setTypeface(tf);
    }

    private void SetTitleFontSanayeDasti() {
        TextView Title1 = findViewById(R.id.txtKhatam);
        TextView Title2 = findViewById(R.id.txtGhalam);
        TextView Title3 = findViewById(R.id.txtMes);
        Typeface tf = Typeface.createFromAsset(getAssets(), "Vazirmatn-Medium.ttf");
        Title1.setTypeface(tf);
        Title2.setTypeface(tf);
        Title3.setTypeface(tf);
    }

    public void IntentPage() {
        setContentView(R.layout.activity_login);
        FormLogin frm = new FormLogin(this, R.id.formLayout);
        Button back = findViewById(R.id.btnBackContactUS);
        back.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View v) {
                setContentView(R.layout.activity_main_page);
                ListData();
                listView = findViewById(R.id.contentList);
                DisplayList();
                OpenActivityForShow();

            }
        });


    }


}